{"maqam_duas": [{"intentions": "Al-Kafirun", "audio_file": "maqam_1.mp3"}], "safa_marwah_duas": [{"arabic": "إِنَّ الصَّفَا وَالْمَرْوَةَ مِنْ شَعَائِرِ الله ", "english": "Start of Safa\nIndeed the hills of Safa and Marwa are among the symbols of Allah", "audio_file": "safa_marwah_1.mp3"}, {"arabic": "", "english": "I begin with that  with which Allah began", "audio_file": "safa_marwah_2.mp3"}, {"arabic": "اللهُ أَكْبَرُ ، اللهُ أَكْبَرُ ، اللهُ أَكْبَرُ  لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ ، وَهَزَمَ الأَحْزَابَ وَحْدَهُ", "english": "Dua should be sayed 3 times at every stop.\n\n“Allah is the Greatest; Allah is the Greatest; Allah is the Greatest, and to Allah belongs all praise. There is no deity except Allah, alone without a partner. To Him belongs the Dominion, and to Him belongs all praise. He gives life and death, and He has power over everything. There is no deity except Allah alone. He fulfilled His promise, supported His slave, and defeated the confederates alone. “\n\n", "audio_file": "safa_marwah_3.mp3"}], "zamzam_duas": [{"arabic": "", "english": "Allaahumma inni as’aluka `ilman naifi`aaa, wa rizqaw wasi`aaa, wa shifa’am min kulli da’i\n\nMeaning: O Allah! I ask you for beneficial knowledge, and plentiful sustenance and cure from every illness.\n\n", "audio_file": "zamzam_1.mp3"}, {"arabic": "", "english": "Dua Between The Yemeni Corner And The Black Stone\n\nRabbanaa 'aatinaa fid-dunyaa hasanatan wa fil-'aakhirati hasanatan wa qinaa 'athaaban-naar.\n\nOur Lord, grant us the good things in this world and the good things in the next life and save us from the punishment of the Fire.", "audio_file": "zamzam_2.mp3"}], "leaving_duas": [{"arabic": "", "english": "Say bismilah and give salutation on to the profet. \nOh Allah I'm asking you for your favor and guard me from Evil.", "audio_file": "leaving_1.mp3"}], "travel_list": [{"arabic": "لَبَّيْكَ اَللَّهُمَّ عُمْرَةً ❁", "english": "Labbayka Llāhumma ʿUmrah.\n\nO Allah, here I am to perform Umrah.", "audio_file": null}, {"arabic": "لَبَّيْكَ اَللَّهُمَّ لَبَّيْكَ – لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ – إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ – لَا شَرِيكَ لَكَ – ❁", "english": "Labbayka Llāhumma labbayk, labbayka lā sharīka laka labbayk, inna l-ḥamda wa n-niʿmata, laka wa l-mulk, lā sharīka lak.\n\nAt Your service, Allah, at Your service. At Your service, You have no partner, at Your service. Truly all praise, favour and sovereignty are Yours. You have no partner.", "audio_file": "travel_2.mp3"}], "masjid_duas": [{"arabic": "بِسْمِ اللهِ ❁ اَللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ ❁ اللّٰهُمَّ اغْفِرْ لِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِكَ ❁", "english": "“Bismillah, was-salatu was-salamu ‘ala rasoolillah, allahumma aftah li abwaba rahmatik.”\n\n“In the name of Allah, and prayers and peace be upon the Messenger of Allah. O Allah, open the gates of Your mercy for me.”", "audio_file": "masjid_1.mp3"}], "tawaf_duas": [[{"arabic": "بسملة,  الله أكبر ", "english": "Start of Tawaf:: SAY\nBismilla, Allahu Akbar ", "audio_url": "", "audio_file": "tawaf_round_1_dua_1.mp3"}, {"arabic": "رَبَّنَا آتِنَا فِي الْدُّنْيَا حَسَنَةً وَفِي الَأخِرَةِ حَسَنةً وَقِنَا عَذَابَ النَّارِ ", "english": "Rabbanaa 'aatinaa fid-dunyaa hasanatan wa fil-'aakhirati hasanatan wa qinaa 'athaaban-naar", "audio_url": "", "audio_file": "tawaf_round_1_dua_2.mp3"}, {"arabic": "", "english": "Allahuma inni as'aluka bi annaka antakkah, la ilaha ill ant,\nal-ahadus-samad, alladhi lam yalid wa lam yulad, wa lam yakun\nlahu kufuwan ahad.", "audio_url": "", "audio_file": "tawaf_round_1_dua_3.mp3"}], [], [], [], [], [], []]}